betaflight/betaflight/src/platform/GD32/sdio_gd32f4xx.c
/*
 * This file is part of Betaflight.
 *
 * Betaflight is free software. You can redistribute this software
 * and/or modify this software under the terms of the GNU General
 * Public License as published by the Free Software Foundation,
 * either version 3 of the License, or (at your option) any later
 * version.
 *
 * Betaflight is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 *
 * See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public
 * License along with this software.
 *
 * If not, see <http://www.gnu.org/licenses/>.
 */

#include <stdbool.h>
#include <string.h>

#include "platform.h"

#ifdef USE_SDCARD_SDIO

#include "drivers/sdmmc_sdio.h"
#include "gd32f4xx_gpio.h"
#include "gd32f4xx_sdio.h"

#include "pg/sdio.h"

#include "drivers/io.h"
#include "drivers/io_impl.h"
#include "drivers/nvic.h"
#include "drivers/time.h"
#include "platform/rcc.h"
#include "drivers/dma.h"
#include "platform/dma.h"
#include "drivers/light_led.h"

#include "build/debug.h"

#define DMA_CHANNEL_4                    ((uint32_t)0x08000000)
#define DMA_MINC_ENABLE                  ((uint32_t)DMA_CHXCTL_MNAGA)
#define DMA_MDATAALIGN_WORD              ((uint32_t)DMA_MEMORY_WIDTH_32BIT)
#define DMA_PDATAALIGN_WORD              ((uint32_t)DMA_PERIPH_WIDTH_32BIT)
#define DMA_MBURST_INC4                  ((uint32_t)DMA_MEMORY_BURST_4_BEAT)
#define DMA_PBURST_INC4                  ((uint32_t)DMA_PERIPH_BURST_4_BEAT)

#define BLOCK_SIZE                       ((uint32_t)(512))

#define INTC_CLEAR_MASK_CH3              ((uint32_t)0x0F40000)
#define INTC_CLEAR_MASK_CH6              ((uint32_t)0x003D000)

#define SDIO_INTC_STATIC_FLAGS           ((uint32_t)(SDIO_INTC_CCRCERRC | SDIO_INTC_DTCRCERRC | SDIO_INTC_CMDTMOUTC |\
                                                     SDIO_INTC_DTTMOUTC | SDIO_INTC_TXUREC | SDIO_INTC_RXOREC  |\
                                                     SDIO_INTC_CMDRECVC  | SDIO_INTC_CMDSENDC  | SDIO_INTC_DTENDC  |\
                                                     SDIO_INTC_DTBLKENDC))

#define SD_SOFTWARE_COMMAND_TIMEOUT      ((uint32_t)0x00220000)

#define SD_OCR_ADDR_OUT_OF_RANGE         ((uint32_t)0x80000000)
#define SD_OCR_ADDR_MISALIGNED           ((uint32_t)0x40000000)
#define SD_OCR_BLOCK_LEN_ERR             ((uint32_t)0x20000000)
#define SD_OCR_ERASE_SEQ_ERR             ((uint32_t)0x10000000)
#define SD_OCR_BAD_ERASE_PARAM           ((uint32_t)0x08000000)
#define SD_OCR_WRITE_PROT_VIOLATION      ((uint32_t)0x04000000)
#define SD_OCR_LOCK_UNLOCK_FAILED        ((uint32_t)0x01000000)
#define SD_OCR_COM_CRC_FAILED            ((uint32_t)0x00800000)
#define SD_OCR_ILLEGAL_CMD               ((uint32_t)0x00400000)
#define SD_OCR_CARD_ECC_FAILED           ((uint32_t)0x00200000)
#define SD_OCR_CC_ERROR                  ((uint32_t)0x00100000)
#define SD_OCR_GENERAL_UNKNOWN_ERROR     ((uint32_t)0x00080000)
#define SD_OCR_STREAM_READ_UNDERRUN      ((uint32_t)0x00040000)
#define SD_OCR_STREAM_WRITE_OVERRUN      ((uint32_t)0x00020000)
#define SD_OCR_CID_CSD_OVERWRITE         ((uint32_t)0x00010000)
#define SD_OCR_WP_ERASE_SKIP             ((uint32_t)0x00008000)
#define SD_OCR_CARD_ECC_DISABLED         ((uint32_t)0x00004000)
#define SD_OCR_ERASE_RESET               ((uint32_t)0x00002000)
#define SD_OCR_AKE_SEQ_ERROR             ((uint32_t)0x00000008)
#define SD_OCR_ERRORBITS                 ((uint32_t)0xFDFFE008)

#define SD_R6_GENERAL_UNKNOWN_ERROR      ((uint32_t)0x00002000)
#define SD_R6_ILLEGAL_CMD                ((uint32_t)0x00004000)
#define SD_R6_COM_CRC_FAILED             ((uint32_t)0x00008000)

#define SD_VOLTAGE_WINDOW_SD             ((uint32_t)0x80100000)
#define SD_RESP_HIGH_CAPACITY            ((uint32_t)0x40000000)
#define SD_RESP_STD_CAPACITY             ((uint32_t)0x00000000)
#define SD_CHECK_PATTERN                 ((uint32_t)0x000001AA)

#define SD_MAX_VOLT_TRIAL                ((uint32_t)0x0000FFFF)
#define SD_ALLZERO                       ((uint32_t)0x00000000)

#define SD_WIDE_BUS_SUPPORT              ((uint32_t)0x00040000)
#define SD_SINGLE_BUS_SUPPORT            ((uint32_t)0x00010000)
#define SD_CARD_LOCKED                   ((uint32_t)0x02000000)

#define SD_0TO7BITS                      ((uint32_t)0x000000FF)
#define SD_8TO15BITS                     ((uint32_t)0x0000FF00)
#define SD_16TO23BITS                    ((uint32_t)0x00FF0000)
#define SD_24TO31BITS                    ((uint32_t)0xFF000000)
#define SD_MAX_DATA_LENGTH               ((uint32_t)0x01FFFFFF)

#define SD_CCCC_ERASE                    ((uint32_t)0x00000020)

#define SD_SDIO_SEND_IF_COND             ((uint32_t)SD_CMD_HS_SEND_EXT_CSD)

#define SD_BUS_WIDE_1B                   ((uint32_t)0x00000000)
#define SD_BUS_WIDE_4B                   SDIO_BUSMODE_4BIT
#define SD_BUS_WIDE_8B                   SDIO_BUSMODE_8BIT

#define SD_CMD_RESPONSE_SHORT            SDIO_RESPONSETYPE_SHORT
#define SD_CMD_RESPONSE_LONG             SDIO_RESPONSETYPE_LONG

#define SD_DATABLOCK_SIZE_8B             SDIO_DATABLOCKSIZE_8BYTES
#define SD_DATABLOCK_SIZE_64B            SDIO_DATABLOCKSIZE_64BYTES
#define SD_DATABLOCK_SIZE_512B           SDIO_DATABLOCKSIZE_512BYTES

#define CLKCTL_CLEAR_MASK                ((uint32_t)(SDIO_CLKCTL_DIV  | SDIO_CLKCTL_CLKPWRSAV |\
                                                     SDIO_CLKCTL_CLKBYP  | SDIO_CLKCTL_BUSMODE |\
                                                     SDIO_CLKCTL_CLKEDGE | SDIO_CLKCTL_HWCLKEN | SDIO_CLKCTL_DIV8))

#define DATACTRL_CLEAR_MASK              ((uint32_t)(SDIO_DATACTL_DATAEN    | SDIO_DATACTL_DATADIR |\
                                                     SDIO_DATACTL_TRANSMOD  | SDIO_DATACTL_BLKSZ))

#define CMDCTL_CLEAR_MASK                ((uint32_t)(SDIO_CMDCTL_CMDIDX | SDIO_CMDCTL_CMDRESP |\
                                                     SDIO_CMDCTL_INTWAIT  | SDIO_CMDCTL_WAITDEND |\
                                                     SDIO_CMDCTL_CSMEN   | SDIO_CMDCTL_SUSPEND))

#define SDIO_INIT_CLK_DIV                ((uint8_t)0x76)
#define SDIO_CLK_DIV                     ((uint8_t)0x02)

#define SD_CMD_GO_IDLE_STATE            ((uint8_t)0)   // Resets the SD memory card.
#define SD_CMD_SEND_OP_COND             ((uint8_t)1)   // Sends host capacity support information and activates the card's initialization process.
#define SD_CMD_ALL_SEND_CID             ((uint8_t)2)   // Asks any card connected to the host to send the CID numbers on the CMD line.
#define SD_CMD_SET_REL_ADDR             ((uint8_t)3)   // Asks the card to publish a new relative address (RCA).
#define SD_CMD_HS_SWITCH                ((uint8_t)6)   // Checks switchable function (mode 0) and switch card function (mode 1).
#define SD_CMD_SEL_DESEL_CARD           ((uint8_t)7)   // Selects the card by its own relative address and gets deselected by any other address
#define SD_CMD_HS_SEND_EXT_CSD          ((uint8_t)8)   // Sends SD Memory Card interface condition, which includes host supply voltage information
                                                       // and asks the card whether card supports voltage.
#define SD_CMD_SEND_CSD                 ((uint8_t)9)   // Addressed card sends its card specific data (CSD) on the CMD line.
#define SD_CMD_SEND_CID                 ((uint8_t)10)  // Addressed card sends its card identification (CID) on the CMD line.
#define SD_CMD_STOP_TRANSMISSION        ((uint8_t)12)  // Forces the card to stop transmission.
#define SD_CMD_SEND_STATUS              ((uint8_t)13)  // Addressed card sends its status register.
#define SD_CMD_SET_BLOCKLEN             ((uint8_t)16)  // Sets the block length (in bytes for SDSC) for all following block commands
                                                       // (read, write, lock). Default block length is fixed to 512 Bytes. Not effective
                                                       // for SDHS and SDXC.
#define SD_CMD_READ_SINGLE_BLOCK        ((uint8_t)17)  // Reads single block of size selected by SET_BLOCKLEN in case of SDSC, and a block of
                                                       // fixed 512 bytes in case of SDHC and SDXC.
#define SD_CMD_READ_MULT_BLOCK          ((uint8_t)18)  // Continuously transfers data blocks from card to host until interrupted by
                                                       // STOP_TRANSMISSION command.
#define SD_CMD_WRITE_SINGLE_BLOCK       ((uint8_t)24)  // Writes single block of size selected by SET_BLOCKLEN in case of SDSC, and a block of
                                                       // fixed 512 bytes in case of SDHC and SDXC.
#define SD_CMD_WRITE_MULT_BLOCK         ((uint8_t)25)  // Continuously writes blocks of data until a STOP_TRANSMISSION follows.
#define SD_CMD_SD_ERASE_GRP_START       ((uint8_t)32)  // Sets the address of the first write block to be erased. (For SD card only).
#define SD_CMD_SD_ERASE_GRP_END         ((uint8_t)33)  // Sets the address of the last write block of the continuous range to be erased.
                                                       // system set by switch function command (CMD6).
#define SD_CMD_ERASE                    ((uint8_t)38)  // Reserved for SD security applications.
#define SD_CMD_FAST_IO                  ((uint8_t)39)  // SD card doesn't support it (Reserved).
#define SD_CMD_APP_CMD                  ((uint8_t)55)  // Indicates to the card that the next command is an application specific command rather
                                                       // than a standard command.

#define SD_NO_RESPONSE                  ((int8_t)-1)

/* Following commands are SD Card Specific commands.
   SDIO_APP_CMD should be sent before sending these commands. */
#define SD_CMD_APP_SD_SET_BUSWIDTH      ((uint8_t)6)   // (ACMD6) Defines the data bus width to be used for data transfer. The allowed data bus
                                                       // widths are given in SCR register.
#define SD_CMD_SD_APP_STATUS            ((uint8_t)13)  // (ACMD13) Sends the SD status.
#define SD_CMD_SD_APP_OP_COND           ((uint8_t)41)  // (ACMD41) Sends host capacity support information (HCS) and asks the accessed card to
                                                       // send its operating condition register (OCR) content in the response on the CMD line.
#define SD_CMD_SD_APP_SEND_SCR          ((uint8_t)51)  // Reads the SD Configuration Register (SCR).

#define SDIO_DIR_TX 1
#define SDIO_DIR_RX 0

#define SDIO_DMA_ST3 1


