betaflight/betaflight/src/platform/GD32/sdio_gd32f4xx.c
typedef enum {
    SD_SINGLE_BLOCK    = 0,             // Single block operation
    SD_MULTIPLE_BLOCK  = 1,             // Multiple blocks operation
} SD_Operation_t;

typedef struct {
    uint32_t          CSD[4];           // SD card specific data table
    uint32_t          CID[4];           // SD card identification number table
    volatile uint32_t TransferComplete; // SD transfer complete flag in non blocking mode
    volatile uint32_t TransferError;    // SD transfer error flag in non blocking mode
    volatile uint32_t RXCplt;           // SD RX Complete is equal 0 when no transfer
    volatile uint32_t TXCplt;           // SD TX Complete is equal 0 when no transfer
    volatile uint32_t Operation;        // SD transfer operation (read/write)
} SD_Handle_t;

typedef enum {
    SD_CARD_READY                  = ((uint32_t)0x00000001),  // Card state is ready
    SD_CARD_IDENTIFICATION         = ((uint32_t)0x00000002),  // Card is in identification state
    SD_CARD_STANDBY                = ((uint32_t)0x00000003),  // Card is in standby state
    SD_CARD_TRANSFER               = ((uint32_t)0x00000004),  // Card is in transfer state
    SD_CARD_SENDING                = ((uint32_t)0x00000005),  // Card is sending an operation
    SD_CARD_RECEIVING              = ((uint32_t)0x00000006),  // Card is receiving operation information
    SD_CARD_PROGRAMMING            = ((uint32_t)0x00000007),  // Card is in programming state
    SD_CARD_DISCONNECTED           = ((uint32_t)0x00000008),  // Card is disconnected
    SD_CARD_ERROR                  = ((uint32_t)0x000000FF)   // Card is in error state
} SD_CardState_t;


static SD_Handle_t                 SD_Handle;
static SD_CardInfo_t               SD_CardInfo;
static uint32_t                    SD_Status;
static uint32_t                    SD_CardRCA;
static SD_CardType_t               SD_CardType;
static volatile uint32_t           TimeOut;
static DMA_Stream_TypeDef          *dmaStream;
static uint32_t                    dma_periph_sdio;
static int                         dma_channel_sdio;


static void             SD_DataTransferInit         (uint32_t Size, uint32_t DataBlockSize, bool IsItReadFromCard);
static SD_Error_t       SD_TransmitCommand          (uint32_t Command, uint32_t Argument, int8_t ResponseType);
static SD_Error_t       SD_CmdResponse              (uint8_t SD_CMD, int8_t ResponseType);
static void             SD_GetResponse              (uint32_t* pResponse);
static SD_Error_t       CheckOCR_Response           (uint32_t Response_R1);
static void             SD_DMA_Complete             (uint32_t dma_periph, dma_channel_enum channelx);
static SD_Error_t       SD_InitializeCard           (void);

static SD_Error_t       SD_PowerON                  (void);
static SD_Error_t       SD_WideBusOperationConfig   (uint32_t WideMode);
static SD_Error_t       SD_FindSCR                  (uint32_t *pSCR);

void SDIO_DMA_ST3_IRQHandler(dmaChannelDescriptor_t *dma);
void SDIO_DMA_ST6_IRQHandler(dmaChannelDescriptor_t *dma);

void sdioPinConfigure(void)
{

}

/*!
    \brief      Prepare the state machine for transfer
    \param[in]  Size: data transfer size
    \param[in]  DataBlockSize: data block size
    \param[in]  IsItReadFromCard: transfer direction flag
    \param[out] none
    \retval     none
*/
static void SD_DataTransferInit(uint32_t Size, uint32_t DataBlockSize, bool IsItReadFromCard)
 {
    uint32_t Direction;

    SDIO_DATATO = SD_DATATIMEOUT;
    SDIO_DATALEN  = Size;
    Direction      = (IsItReadFromCard == true) ? SDIO_DATACTL_DATADIR : 0;
    SDIO_DATACTL |=  (uint32_t)(DataBlockSize | Direction | SDIO_DATACTL_DATAEN  | 0x01);
    return;
}

/*!
    \brief      Send the command to SDIO
    \param[in]  Command: SDIO command
    \param[in]  Argument: command argument
    \param[in]  ResponseType: response type (must provide the response size)
    \param[out] none
    \retval     SD Card error state
*/
static SD_Error_t SD_TransmitCommand(uint32_t Command, uint32_t Argument, int8_t ResponseType)
{
    SD_Error_t ErrorState;

    SDIO_INTC = SDIO_INTC_STATIC_FLAGS;                                         // Clear the Command Flags
    /* disable the CSM */
    SDIO_CMDCTL &= ~SDIO_CMDCTL_CSMEN;
    SDIO_CMDAGMT = (uint32_t)Argument;                                          // Set the SDIO Argument value
    SDIO_CMDCTL = (uint32_t)(Command | SDIO_CMDCTL_CSMEN);                      // Set SDIO command parameters
    if((Argument == 0) && (ResponseType == 0)) ResponseType = SD_NO_RESPONSE;   // Go idle command
    ErrorState  = SD_CmdResponse(Command & SDIO_CMDCTL_CMDIDX, ResponseType);
    SDIO_INTC = SDIO_INTC_STATIC_FLAGS;                                         // Clear the Command Flags

    return ErrorState;
}

/*!
    \brief      Checks for error conditions for any response (R2, R3, etc.)
    \param[in]  SD_CMD: the sent command Index
    \param[in]  ResponseType: response type
    \param[out] none
    \retval     SD Card error state
*/
static SD_Error_t SD_CmdResponse(uint8_t SD_CMD, int8_t ResponseType)
{
    uint32_t Response_R1;
    uint32_t TimeOut;
    uint32_t Flag;

    if(ResponseType == SD_NO_RESPONSE) {
        Flag = SDIO_STAT_CMDSEND;
    } else {
        Flag = SDIO_STAT_CCRCERR | SDIO_STAT_CMDRECV | SDIO_STAT_CMDTMOUT;
    }

    TimeOut = SD_SOFTWARE_COMMAND_TIMEOUT;
    do {
        SD_Status = SDIO_STAT;
        TimeOut--;
    } while(((SD_Status & Flag) == 0) && (TimeOut > 0));

    if(ResponseType <= 0) {
        if(TimeOut == 0) {
            return SD_CMD_RSP_TIMEOUT;
        } else {
            return SD_OK;
        }
    }

    if((SDIO_STAT & SDIO_STAT_CMDTMOUT) != 0) {
        return SD_CMD_RSP_TIMEOUT;
    }

    if(ResponseType == 3) {
        if(TimeOut == 0) {
            return SD_CMD_RSP_TIMEOUT;  // Card is not V2.0 compliant or card does not support the set voltage range
        } else {
            return SD_OK;               // Card is SD V2.0 compliant
        }
    }

    if((SDIO_STAT & SDIO_STAT_CCRCERR) != 0) {
        return SD_CMD_CRC_FAIL;
    }
    if(ResponseType == 2) {
        return SD_OK;
    }
    if((uint8_t)SDIO_RSPCMDIDX != SD_CMD) {
        return SD_ILLEGAL_CMD;
    }

    Response_R1 = SDIO_RESP0;                    // We have received response, retrieve it for analysis

