betaflight/betaflight/src/platform/GD32/sdio_gd32f4xx.c
    if(ResponseType == 1) {
        return CheckOCR_Response(Response_R1);
    } else if(ResponseType == 6) {
        if((Response_R1 & (SD_R6_GENERAL_UNKNOWN_ERROR | SD_R6_ILLEGAL_CMD | SD_R6_COM_CRC_FAILED)) == SD_ALLZERO) {
            SD_CardRCA = Response_R1;
        }
        if((Response_R1 & SD_R6_GENERAL_UNKNOWN_ERROR) == SD_R6_GENERAL_UNKNOWN_ERROR) {
            return SD_GENERAL_UNKNOWN_ERROR;
        }
        if((Response_R1 & SD_R6_ILLEGAL_CMD) == SD_R6_ILLEGAL_CMD) {
            return SD_ILLEGAL_CMD;
        }
        if((Response_R1 & SD_R6_COM_CRC_FAILED) == SD_R6_COM_CRC_FAILED) {
            return SD_COM_CRC_FAILED;
        }
    }

    return SD_OK;
}

/*!
    \brief      Analyze the OCR response and return the appropriate error code
    \param[in]  Response_R1: OCR Response code
    \param[out] none
    \retval     SD Card error state
*/
static SD_Error_t CheckOCR_Response(uint32_t Response_R1)
{
    if((Response_R1 & SD_OCR_ERRORBITS)             == SD_ALLZERO)                  return SD_OK;
    if((Response_R1 & SD_OCR_ADDR_OUT_OF_RANGE)     == SD_OCR_ADDR_OUT_OF_RANGE)    return SD_ADDR_OUT_OF_RANGE;
    if((Response_R1 & SD_OCR_ADDR_MISALIGNED)       == SD_OCR_ADDR_MISALIGNED)      return SD_ADDR_MISALIGNED;
    if((Response_R1 & SD_OCR_BLOCK_LEN_ERR)         == SD_OCR_BLOCK_LEN_ERR)        return SD_BLOCK_LEN_ERR;
    if((Response_R1 & SD_OCR_ERASE_SEQ_ERR)         == SD_OCR_ERASE_SEQ_ERR)        return SD_ERASE_SEQ_ERR;
    if((Response_R1 & SD_OCR_BAD_ERASE_PARAM)       == SD_OCR_BAD_ERASE_PARAM)      return SD_BAD_ERASE_PARAM;
    if((Response_R1 & SD_OCR_WRITE_PROT_VIOLATION)  == SD_OCR_WRITE_PROT_VIOLATION) return SD_WRITE_PROT_VIOLATION;
    if((Response_R1 & SD_OCR_LOCK_UNLOCK_FAILED)    == SD_OCR_LOCK_UNLOCK_FAILED)   return SD_LOCK_UNLOCK_FAILED;
    if((Response_R1 & SD_OCR_COM_CRC_FAILED)        == SD_OCR_COM_CRC_FAILED)       return SD_COM_CRC_FAILED;
    if((Response_R1 & SD_OCR_ILLEGAL_CMD)           == SD_OCR_ILLEGAL_CMD)          return SD_ILLEGAL_CMD;
    if((Response_R1 & SD_OCR_CARD_ECC_FAILED)       == SD_OCR_CARD_ECC_FAILED)      return SD_CARD_ECC_FAILED;
    if((Response_R1 & SD_OCR_CC_ERROR)              == SD_OCR_CC_ERROR)             return SD_CC_ERROR;
    if((Response_R1 & SD_OCR_GENERAL_UNKNOWN_ERROR) == SD_OCR_GENERAL_UNKNOWN_ERROR)return SD_GENERAL_UNKNOWN_ERROR;
    if((Response_R1 & SD_OCR_STREAM_READ_UNDERRUN)  == SD_OCR_STREAM_READ_UNDERRUN) return SD_STREAM_READ_UNDERRUN;
    if((Response_R1 & SD_OCR_STREAM_WRITE_OVERRUN)  == SD_OCR_STREAM_WRITE_OVERRUN) return SD_STREAM_WRITE_OVERRUN;
    if((Response_R1 & SD_OCR_CID_CSD_OVERWRITE)     == SD_OCR_CID_CSD_OVERWRITE)    return SD_CID_CSD_OVERWRITE;
    if((Response_R1 & SD_OCR_WP_ERASE_SKIP)         == SD_OCR_WP_ERASE_SKIP)        return SD_WP_ERASE_SKIP;
    if((Response_R1 & SD_OCR_CARD_ECC_DISABLED)     == SD_OCR_CARD_ECC_DISABLED)    return SD_CARD_ECC_DISABLED;
    if((Response_R1 & SD_OCR_ERASE_RESET)           == SD_OCR_ERASE_RESET)          return SD_ERASE_RESET;
    if((Response_R1 & SD_OCR_AKE_SEQ_ERROR)         == SD_OCR_AKE_SEQ_ERROR)        return SD_AKE_SEQ_ERROR;

    return SD_OK;
}

/*!
    \brief      Get response from SD device
    \param[in]  none
    \param[out] pResponse: pointer to response buffer
    \retval     none
*/
static void SD_GetResponse(uint32_t* pResponse)
{
    pResponse[0] = SDIO_RESP0;
    pResponse[1] = SDIO_RESP1;
    pResponse[2] = SDIO_RESP2;
    pResponse[3] = SDIO_RESP3;
}

/*!
    \brief      SD DMA transfer complete RX and TX callback
    \param[in]  dma_periph: DMA peripheral
    \param[in]  channelx: DMA channel
    \param[out] none
    \retval     none
*/
static void SD_DMA_Complete(uint32_t dma_periph, dma_channel_enum channelx)
{
    if (SD_Handle.RXCplt) {
            if (SD_Handle.Operation == ((SDIO_DIR_RX << 1) | SD_MULTIPLE_BLOCK)) {
                /* Send stop command in multiblock write */
                SD_TransmitCommand((SD_CMD_STOP_TRANSMISSION | SD_CMD_RESPONSE_SHORT), 0, 1);
            }

            SDIO_DATACTL &= (uint32_t)~((uint32_t)SDIO_DATACTL_DMAEN);

            /* Clear all the static flags */
            SDIO_INTC = SDIO_INTC_STATIC_FLAGS;

            /* Clear flag */
            SD_Handle.RXCplt = 0;

            /* Disable the channel */
            DMA_CHCTL(dma_periph, channelx) &= ~DMA_CHXCTL_CHEN;
    } else {
            /* Enable Dataend IE */
            SDIO_INTEN |= SDIO_INTEN_DTENDIE;
    }
}

/*!
    \brief      Prepare the DMA transfer
    \param[in]  pBuffer: pointer to the buffer that will contain the data to transmit
    \param[in]  BlockSize: the SD card Data block size (must be 512 bytes)
    \param[in]  NumberOfBlocks: number of blocks to write
    \param[in]  dir: transfer direction
    \param[out] none
    \retval     none
    \note       BlockSize must be 512 bytes
*/
static SD_Error_t SD_InitializeCard(void)
{
    SD_Error_t ErrorState = SD_OK;

    if((SDIO_PWRCTL & SDIO_PWRCTL_PWRCTL) != 0)
    {
        if(SD_CardType != SD_SECURE_DIGITAL_IO) {
            // Send CMD2 ALL_SEND_CID
            if((ErrorState = SD_TransmitCommand((SD_CMD_ALL_SEND_CID | SD_CMD_RESPONSE_LONG), 0, 2)) != SD_OK) {
                return ErrorState;
            }

            // Get Card identification number data
            SD_GetResponse(SD_Handle.CID);
        }

        if((SD_CardType == SD_STD_CAPACITY_V1_1)    || (SD_CardType == SD_STD_CAPACITY_V2_0) ||
           (SD_CardType == SD_SECURE_DIGITAL_IO_COMBO) || (SD_CardType == SD_HIGH_CAPACITY)) {
            // Send CMD3 SET_REL_ADDR with argument 0
            // SD Card publishes its RCA.
            if((ErrorState = SD_TransmitCommand((SD_CMD_SET_REL_ADDR | SD_CMD_RESPONSE_SHORT), 0, 6)) != SD_OK) {
                return ErrorState;
            }
        }

        if(SD_CardType != SD_SECURE_DIGITAL_IO) {
            // Send CMD9 SEND_CSD with argument as card's RCA
            if((ErrorState = SD_TransmitCommand((SD_CMD_SEND_CSD | SD_CMD_RESPONSE_LONG), SD_CardRCA, 2)) == SD_OK) {
                // Get Card Specific Data
                SD_GetResponse(SD_Handle.CSD);
            }
        }
    } else {
        ErrorState = SD_REQUEST_NOT_APPLICABLE;
    }

    return ErrorState;
}

/*!
    \brief      Reads block(s) from a specified address in a card. The Data transfer is managed by DMA mode
    \param[in]  ReadAddress: address from where data is to be read
    \param[in]  buffer: pointer to the buffer that will contain the received data
    \param[in]  BlockSize: SD card Data block size (must be 512 bytes)
    \param[in]  NumberOfBlocks: number of blocks to read
    \param[out] none
    \retval     SD Card error state
    \note       This API should be followed by the function SD_CheckOperation() to check the completion of the read process. BlockSize must be 512 bytes
*/
static void SD_StartBlockTransfert(uint32_t* pBuffer, uint32_t BlockSize, uint32_t NumberOfBlocks, uint8_t dir)
{
    SDIO_DATACTL                = 0;                                                                 // Initialize data control register
    SD_Handle.TransferComplete = 0;                                                                  // Initialize handle flags
    SD_Handle.TransferError    = SD_OK;
    SD_Handle.Operation        = (NumberOfBlocks > 1) ? SD_MULTIPLE_BLOCK : SD_SINGLE_BLOCK;         // Initialize SD Read operation
    SD_Handle.Operation       |= dir << 1;
    SDIO_INTEN                 = 0;
    if (dir == SDIO_DIR_RX) {
        SDIO_INTEN            |= (SDIO_INTEN_DTCRCERRIE | SDIO_INTEN_DTTMOUTIE |                     // Enable transfer interrupts
                                      SDIO_INTEN_DTENDIE  | SDIO_INTEN_RXOREIE);
    } else {
        SDIO_INTEN            |= (SDIO_INTEN_DTCRCERRIE | SDIO_INTEN_DTTMOUTIE |                     // Enable transfer interrupts
                                      SDIO_INTEN_TXUREIE);
    }
    if (dir == SDIO_DIR_TX) {
        SDIO_DATACTL               |= SDIO_DATACTL_DMAEN;                                              // Enable SDIO DMA transfer
    }
    DMA_CHCTL(dma_periph_sdio,dma_channel_sdio)                 &= ~DMA_CHXCTL_CHEN;                                                      // Disable the Peripheral
    while (DMA_CHCTL(dma_periph_sdio,dma_channel_sdio) & DMA_CHXCTL_CHEN);
    DMA_CHCNT(dma_periph_sdio,dma_channel_sdio)                 = (uint32_t) (BlockSize * NumberOfBlocks) / 4;                       // Configure DMA Stream data length
    DMA_CHM0ADDR(dma_periph_sdio,dma_channel_sdio)              = (uint32_t) pBuffer;                                                // Configure DMA Stream memory address
    if (dir == SDIO_DIR_RX) {
       DMA_CHCTL(dma_periph_sdio,dma_channel_sdio)  &= ~(0x01U << 6U);                                                               // Sets peripheral to memory
    } else {
       DMA_CHCTL(dma_periph_sdio,dma_channel_sdio)  |= DMA_MEMORY_TO_PERIPH;                                                         // Sets memory to peripheral
    }
    if ((uint32_t)dmaStream == DMA1_CH3_BASE) {
            // clear dma flags
            dma_flag_clear(DMA1, DMA1_CH3, DMA_FLAG_FEE | DMA_FLAG_SDE | DMA_FLAG_TAE | DMA_FLAG_HTF | DMA_FLAG_FTF);
    } else {
            // clear dma flags
            dma_flag_clear(DMA1, DMA1_CH6, DMA_FLAG_FEE | DMA_FLAG_SDE | DMA_FLAG_TAE | DMA_FLAG_HTF | DMA_FLAG_FTF);                         // Clear the transfer error flag
    }
    DMA_CHCTL(dma_periph_sdio,dma_channel_sdio)                 |= DMA_CHXCTL_FTFIE | DMA_CHXCTL_HTFIE | DMA_CHXCTL_TAEIE | DMA_CHXCTL_SDEIE;    // Enable all interrupts
    DMA_CHFCTL(dma_periph_sdio,dma_channel_sdio)                |= DMA_CHXFCTL_FEEIE;
    DMA_CHCTL(dma_periph_sdio,dma_channel_sdio)                 |= DMA_CHXCTL_CHEN;                                                       // Enable the Peripheral
    if (dir == SDIO_DIR_RX) {
        SDIO_DATACTL               |= SDIO_DATACTL_DMAEN;                                              // Enable SDIO DMA transfer
    }
}

/*!
    \brief      Writes block(s) to a specified address in a card. The Data transfer is managed by DMA mode
    \param[in]  WriteAddress: address from where data is to be read
    \param[in]  buffer: pointer to the buffer that will contain the data to transmit
    \param[in]  BlockSize: the SD card Data block size (must be 512 bytes)
    \param[in]  NumberOfBlocks: number of blocks to write
    \param[out] none
    \retval     SD Card error state
    \note       This API should be followed by the function SD_CheckOperation() to check the completion of the write process (by SD current status polling). BlockSize must be 512 bytes
*/
SD_Error_t SD_ReadBlocks_DMA(uint64_t ReadAddress, uint32_t *buffer, uint32_t BlockSize, uint32_t NumberOfBlocks)
{
    SD_Error_t ErrorState = SD_OK;
    uint32_t   CmdIndex;
    SD_Handle.RXCplt = 1;

    if(SD_CardType != SD_HIGH_CAPACITY)
    {
        ReadAddress *= 512;
    }

