betaflight/betaflight/src/platform/GD32/sdio_gd32f4xx.c
            Response = SDIO_RESP0;                                  // Get command response
            ValidVoltage = (((Response >> 31) == 1) ? 1 : 0);       // Get operating voltage
            Count++;
        }

        if(Count >= SD_MAX_VOLT_TRIAL) {
            return SD_INVALID_VOLTRANGE;
        }

        if((Response & SD_RESP_HIGH_CAPACITY) == SD_RESP_HIGH_CAPACITY) {
            SD_CardType = SD_HIGH_CAPACITY;
        }
    } // else MMC Card

    return ErrorState;
}

static SD_Error_t SD_FindSCR(uint32_t *pSCR)
{
    SD_Error_t ErrorState;
    uint32_t Index = 0;
    uint32_t tempscr[2] = {0, 0};

    // Set Block Size To 8 Bytes
    // Send CMD55 APP_CMD with argument as card's RCA
    if((ErrorState = SD_TransmitCommand((SD_CMD_SET_BLOCKLEN | SD_CMD_RESPONSE_SHORT), 8, 1)) == SD_OK) {
        // Send CMD55 APP_CMD with argument as card's RCA
        if((ErrorState = SD_TransmitCommand((SD_CMD_APP_CMD | SD_CMD_RESPONSE_SHORT), SD_CardRCA, 1)) == SD_OK) {
            SD_DataTransferInit(8, SD_DATABLOCK_SIZE_8B, true);

            // Send ACMD51 SD_APP_SEND_SCR with argument as 0
            if((ErrorState = SD_TransmitCommand((SD_CMD_SD_APP_SEND_SCR | SD_CMD_RESPONSE_SHORT), 0, 1)) == SD_OK) {
                while((SDIO_STAT & (SDIO_STAT_RXORE | SDIO_STAT_DTCRCERR | SDIO_STAT_DTTMOUT | SDIO_STAT_DTBLKEND)) == 0) {
                    if((SDIO_STAT & SDIO_STAT_RXDTVAL) != 0) {
                        *(tempscr + Index) = SDIO_FIFO;
                        Index++;
                    }
                }

                if     ((SDIO_STAT & SDIO_STAT_DTTMOUT) != 0) ErrorState = SD_DATA_TIMEOUT;
                else if((SDIO_STAT & SDIO_STAT_DTCRCERR) != 0) ErrorState = SD_DATA_CRC_FAIL;
                else if((SDIO_STAT & SDIO_STAT_RXORE)  != 0) ErrorState = SD_RX_OVERRUN;
                else if((SDIO_STAT & SDIO_STAT_RXDTVAL)   != 0) ErrorState = SD_OUT_OF_BOUND;
                else
                {
                    *(pSCR + 1) = ((tempscr[0] & SD_0TO7BITS) << 24)  | ((tempscr[0] & SD_8TO15BITS) << 8) |
                                  ((tempscr[0] & SD_16TO23BITS) >> 8) | ((tempscr[0] & SD_24TO31BITS) >> 24);

                    *(pSCR) = ((tempscr[1] & SD_0TO7BITS) << 24)  | ((tempscr[1] & SD_8TO15BITS) << 8) |
                              ((tempscr[1] & SD_16TO23BITS) >> 8) | ((tempscr[1] & SD_24TO31BITS) >> 24);
                }

            }
        }
    }

    return ErrorState;
}

void sdioInitialize(void)
{

}

bool SD_InitialiseHardware(dmaResource_t *dma)
{
    const dmaIdentifier_e dmaIdentifier = dmaGetIdentifier((dmaResource_t *)dma);

    dmaStream = dma;

    if (!((uint32_t)dma == DMA1_CH3_BASE || (uint32_t)dma == DMA1_CH6_BASE) || !dmaAllocate(dmaIdentifier, OWNER_SDCARD, 0)) {
        return false;
    }

    // Reset SDIO Module
    RCU_APB2RST |=  RCU_APB2RST_SDIORST;
    delay(1);
    RCU_APB2RST &= ~RCU_APB2RST_SDIORST;
    delay(1);

    // Enable SDIO clock
    RCU_APB2EN |= RCU_APB2EN_SDIOEN;

    // Enable DMA2 clocks
    RCU_AHB1EN |= RCU_AHB1EN_DMA1EN;

    //Configure Pins
    RCU_AHB1EN |= RCU_AHB1EN_PCEN | RCU_AHB1EN_PDEN;

    uint8_t is4BitWidth = sdioConfig()->use4BitWidth;

    const IO_t d0  = IOGetByTag(sdioPinConfig()->D0Pin);
    const IO_t d1  = IOGetByTag(sdioPinConfig()->D1Pin);
    const IO_t d2  = IOGetByTag(sdioPinConfig()->D2Pin);
    const IO_t d3  = IOGetByTag(sdioPinConfig()->D3Pin);
    const IO_t clk = IOGetByTag(sdioPinConfig()->CKPin);
    const IO_t cmd = IOGetByTag(sdioPinConfig()->CMDPin);

    IOInit(d0, OWNER_SDCARD, 0);
    if (is4BitWidth) {
        IOInit(d1, OWNER_SDCARD, 0);
        IOInit(d2, OWNER_SDCARD, 0);
        IOInit(d3, OWNER_SDCARD, 0);
    }
    IOInit(clk, OWNER_SDCARD, 0);
    IOInit(cmd, OWNER_SDCARD, 0);

#define SDIO_DATA       IO_CONFIG(GPIO_MODE_AF, GPIO_OSPEED_25MHZ, GPIO_OTYPE_PP, GPIO_PUPD_PULLUP)
#define SDIO_CMD        IO_CONFIG(GPIO_MODE_AF, GPIO_OSPEED_25MHZ, GPIO_OTYPE_PP, GPIO_PUPD_PULLUP)
#define SDIO_CLK        IO_CONFIG(GPIO_MODE_AF, GPIO_OSPEED_25MHZ, GPIO_OTYPE_PP, GPIO_PUPD_NONE)

    IOConfigGPIOAF(d0, SDIO_DATA, GPIO_AF_12);

    if (is4BitWidth) {
        IOConfigGPIOAF(d1, SDIO_DATA, GPIO_AF_12);
        IOConfigGPIOAF(d2, SDIO_DATA, GPIO_AF_12);
        IOConfigGPIOAF(d3, SDIO_DATA, GPIO_AF_12);
    }

    IOConfigGPIOAF(clk, SDIO_CLK, GPIO_AF_12);
    IOConfigGPIOAF(cmd, SDIO_CMD, GPIO_AF_12);

    // NVIC configuration for SDIO interrupts
    nvic_irq_enable(SDIO_IRQn, 1, 0);

    gd32_dma_chbase_parse((uint32_t)dma, &dma_periph_sdio, &dma_channel_sdio);

    RCU_AHB1EN |= RCU_AHB1EN_DMA1EN;
    // Initialize DMA
    DMA_CHCTL(dma_periph_sdio,dma_channel_sdio) = 0;      // Reset DMA Stream control register
    DMA_CHPADDR(dma_periph_sdio,dma_channel_sdio)  = (uint32_t)&SDIO_FIFO;

    if ((uint32_t)dmaStream == DMA1_CH3_BASE) {
        DMA_INTC0(dma_periph_sdio) = INTC_CLEAR_MASK_CH3; // Clear all interrupt flags
    } else {
        DMA_INTC1(dma_periph_sdio) = INTC_CLEAR_MASK_CH6; // Clear all interrupt flags
    }

    DMA_CHCTL(dma_periph_sdio,dma_channel_sdio) = (DMA_CHANNEL_4 | DMA_CHXCTL_TFCS |       // Prepare the DMA Stream configuration
                                                   DMA_MINC_ENABLE | DMA_PDATAALIGN_WORD | // And write to DMA Stream CR register
                                                   DMA_MDATAALIGN_WORD | DMA_PRIORITY_ULTRA_HIGH |
                                                   DMA_MBURST_INC4 | DMA_PBURST_INC4 |
                                                   DMA_MEMORY_TO_PERIPH);
    DMA_CHFCTL(dma_periph_sdio,dma_channel_sdio)  = (DMA_CHXFCTL_MDMEN | DMA_FIFO_4_WORD); // Configuration FIFO control register
    dmaEnable(dmaIdentifier);

    if ((uint32_t)dmaStream == DMA1_CH3_BASE) {
        dmaSetHandler(dmaIdentifier, SDIO_DMA_ST3_IRQHandler, 1, 0);
    } else {
        dmaSetHandler(dmaIdentifier, SDIO_DMA_ST6_IRQHandler, 1, 0);
    }

    return true;
}

bool SD_GetState(void)
{
    // Check SDCARD status
    if(SD_GetStatus() == SD_OK) return true;
    return false;
}

static SD_Error_t SD_DoInit(void)
{
    SD_Error_t errorState;
    uint32_t reg;

    // Initialize SDIO peripheral interface with default configuration for SD card initialization.
    reg = SDIO_CLKCTL;
    reg &= ~CLKCTL_CLEAR_MASK;
    reg |= (uint32_t)SDIO_INIT_CLK_DIV;
    SDIO_CLKCTL = reg;

    // Identify card operating voltage.
    errorState = SD_PowerON();
    if (errorState != SD_OK) {
        return errorState;
    }

    // Initialize the present card and put them in idle state.
    errorState = SD_InitializeCard();
    if (errorState != SD_OK) {
        return errorState;
    }

