betaflight/betaflight/src/platform/GD32/sdio_gd32f4xx.c
    // Read CSD/CID MSD registers.
    errorState = SD_GetCardInfo();
    if (errorState != SD_OK) {
        return errorState;
    }

    // Select the Card - Send CMD7 SDIO_SEL_DESEL_CARD.
    errorState = SD_TransmitCommand((SD_CMD_SEL_DESEL_CARD | SD_CMD_RESPONSE_SHORT), SD_CardRCA, 1);
    // Configure SDIO peripheral interface.
    reg = SDIO_CLKCTL;
    reg &= ~CLKCTL_CLEAR_MASK;
    reg |= (uint32_t) SDIO_CLK_DIV;
    SDIO_CLKCTL = reg;

    // Configure SD Bus width.
    if (errorState == SD_OK) {
        // Enable wide operation.
        if (sdioConfig()->use4BitWidth) {
            errorState = SD_WideBusOperationConfig(SD_BUS_WIDE_4B);
        } else {
            errorState = SD_WideBusOperationConfig(SD_BUS_WIDE_1B);
        }

        if (errorState == SD_OK && sdioConfig()->clockBypass) {
            if (SD_HighSpeed()) {
                SDIO_CLKCTL |= SDIO_CLKCTL_CLKBYP;
                SDIO_CLKCTL |= SDIO_CLKCTL_CLKEDGE;
            }
        }
    }

    return errorState;
}

SD_Error_t SD_Init(void)
{
    static bool sdInitAttempted = false;
    static SD_Error_t result = SD_ERROR;

    if (sdInitAttempted) {
        return result;
    }

    sdInitAttempted = true;

    result = SD_DoInit();

    return result;
}

/*!
    \brief      This function handles SD card interrupt request
    \param[in]  none
    \param[out] none
    \retval     none
*/
void SDIO_IRQHandler(void)
{
    // Check for SDIO interrupt flags
    if ((SDIO_STAT & SDIO_STAT_DTEND) != 0) {
        SDIO_INTC = SDIO_INTC_DTENDC;
        SDIO_INTC = SDIO_INTC_STATIC_FLAGS;
        SDIO_INTEN &= ~(SDIO_INTEN_DTENDIE | SDIO_INTEN_DTCRCERRIE | SDIO_INTEN_DTTMOUTIE |
                        SDIO_INTEN_TXUREIE | SDIO_INTEN_RXOREIE | SDIO_INTEN_TFHIE | SDIO_INTEN_RFHIE);

        /* Currently doesn't implement multiple block write handling */
        if ((SD_Handle.Operation & 0x02) == (SDIO_DIR_TX << 1)) {
            /* Disable the stream */
            DMA_CHCTL(dma_periph_sdio,dma_channel_sdio) &= ~DMA_CHXCTL_CHEN;
            SDIO_DATACTL &= ~(SDIO_DATACTL_DMAEN);
            /* Transfer is complete */
            SD_Handle.TXCplt = 0;
            if ((SD_Handle.Operation & 0x01) == SD_MULTIPLE_BLOCK) {
                /* Send stop command in multiblock write */
                SD_TransmitCommand((SD_CMD_STOP_TRANSMISSION | SD_CMD_RESPONSE_SHORT), 0, 1);
            }
        }

        SD_Handle.TransferComplete = 1;
        SD_Handle.TransferError = SD_OK;
    } else if ((SDIO_STAT & SDIO_STAT_DTCRCERR) != 0)
        SD_Handle.TransferError = SD_DATA_CRC_FAIL;
    else if ((SDIO_STAT & SDIO_STAT_DTTMOUT) != 0)
        SD_Handle.TransferError = SD_DATA_TIMEOUT;
    else if ((SDIO_STAT & SDIO_STAT_RXORE) != 0)
        SD_Handle.TransferError = SD_RX_OVERRUN;
    else if ((SDIO_STAT & SDIO_STAT_TXURE) != 0)
        SD_Handle.TransferError = SD_TX_UNDERRUN;

    SDIO_INTC = SDIO_INTC_STATIC_FLAGS;

    // Disable all SDIO peripheral interrupt sources
    SDIO_INTEN &= ~(SDIO_INTEN_DTCRCERRIE | SDIO_INTEN_DTTMOUTIE |
                    SDIO_INTEN_DTENDIE |
                    SDIO_INTEN_TFHIE | SDIO_INTEN_RFHIE | SDIO_INTEN_TXUREIE |
                    SDIO_INTEN_RXOREIE);
}

/*!
    \brief      Common handler for DMA stream interrupt requests
    \param[in]  dma_periph: DMA peripheral (DMA0 or DMA1)
    \param[in]  dma_channel: DMA channel (DMA_CH0 ~ DMA_CH7)
    \param[out] none
    \retval     none
*/
static void SDIO_DMA_IRQHandler_Common(uint32_t dma_periph, dma_channel_enum dma_channel)
{
    // Transfer Error Interrupt management
    if(dma_interrupt_flag_get(dma_periph, dma_channel, DMA_INT_FLAG_TAE)) {
        if(dma_interrupt_enable_get(dma_periph, dma_channel, DMA_CHXCTL_TAEIE)) {
            dma_interrupt_disable(dma_periph, dma_channel, DMA_CHXCTL_TAEIE);
            dma_interrupt_flag_clear(dma_periph, dma_channel, DMA_INT_FLAG_TAE);
        }
    }

    // FIFO Error Interrupt management
    if(dma_interrupt_flag_get(dma_periph, dma_channel, DMA_INT_FLAG_FEE)) {
        if(dma_interrupt_enable_get(dma_periph, dma_channel, DMA_CHXFCTL_FEEIE)) {
            dma_interrupt_disable(dma_periph, dma_channel, DMA_CHXFCTL_FEEIE);
            dma_interrupt_flag_clear(dma_periph, dma_channel, DMA_INT_FLAG_FEE);
        }
    }

    // Single data mode exception flag
    if(dma_interrupt_flag_get(dma_periph, dma_channel, DMA_INT_FLAG_SDE)) {
        if(dma_interrupt_enable_get(dma_periph, dma_channel, DMA_CHXCTL_SDEIE)) {
            dma_interrupt_disable(dma_periph, dma_channel, DMA_CHXCTL_SDEIE);
            dma_interrupt_flag_clear(dma_periph, dma_channel, DMA_INT_FLAG_SDE);
        }
    }

    // Half Transfer Complete Interrupt management
    if(dma_interrupt_flag_get(dma_periph, dma_channel, DMA_INT_FLAG_HTF)) {
        if(dma_interrupt_enable_get(dma_periph, dma_channel, DMA_CHXCTL_HTFIE)) {
            if(dma_single_data_mode_get(dma_periph, dma_channel) != RESET) {
                dma_interrupt_flag_clear(dma_periph, dma_channel, DMA_INT_FLAG_HTF);
            } else {
                if(dma_circulation_get(dma_periph, dma_channel) == RESET) {
                    dma_interrupt_disable(dma_periph, dma_channel, DMA_CHXCTL_HTFIE);
                }

                dma_interrupt_flag_clear(dma_periph, dma_channel, DMA_INT_FLAG_HTF);
            }
        }
    }

    // Transfer Complete Interrupt management
    if(dma_interrupt_flag_get(dma_periph, dma_channel, DMA_INT_FLAG_FTF)) {
        if(dma_interrupt_enable_get(dma_periph, dma_channel, DMA_CHXCTL_FTFIE)) {
            if(dma_single_data_mode_get(dma_periph, dma_channel) != RESET) {
                dma_interrupt_flag_clear(dma_periph, dma_channel, DMA_INT_FLAG_FTF);
            } else {
                if(dma_circulation_get(dma_periph, dma_channel) == RESET) {
                    dma_interrupt_disable(dma_periph, dma_channel, DMA_CHXCTL_FTFIE);
                }

                dma_interrupt_flag_clear(dma_periph, dma_channel, DMA_INT_FLAG_FTF);
                SD_DMA_Complete(dma_periph, dma_channel);
            }
        }
    }
}

/*!
    \brief      This function handles DMA2 Stream 3 interrupt request
    \param[in]  dma: DMA channel descriptor
    \param[out] none
    \retval     none
*/
void SDIO_DMA_ST3_IRQHandler(dmaChannelDescriptor_t *dma)
{
    UNUSED(dma);
    SDIO_DMA_IRQHandler_Common(DMA1, DMA_CH3);
}

/*!
    \brief      This function handles DMA2 Stream 6 interrupt request
    \param[in]  dma: DMA channel descriptor
    \param[out] none
    \retval     none
*/
void SDIO_DMA_ST6_IRQHandler(dmaChannelDescriptor_t *dma)
{
    UNUSED(dma);
    SDIO_DMA_IRQHandler_Common(DMA1, DMA_CH6);
}

#endif
